var storyContent = {
	"inkVersion": 21,
	"root": [
		[{
				"->": "plot1_intro"
			},
			["done", {
				"#f": 5,
				"#n": "g-0"
			}], null
		], "done", {
			"plot1_intro": [
				["ev", {
						"VAR?": "hero"
					}, "out", "/ev", "^的卫星终端信号彻底消失。古木遮天，空气里满是苔藓与腐殖质的味道，安静得能听见血液流淌的声音。", "\n", "^一只蓝紫色蝴蝶落在",
					"ev", {
						"VAR?": "hero"
					}, "out", "/ev", "^手背，旋即飞向林间深处，仿佛在示意跟上去。我的通讯设备电量完全耗尽。密林盘绕，枝叶间淌着潮湿阴冷的雾气，死寂得能听见心跳震颤的回响。一双银灰色飞蛾停在我肩头，转瞬掠向幽林暗隅，好似在指引往前走去。", "\n", "ev", "str", "^跟着蝴蝶走", "/str", "/ev", {
						"*": ".^.c-0",
						"flg": 20
					}, "ev", "str", "^呼喊摄制组", "/str", "/ev", {
						"*": ".^.c-1",
						"flg": 20
					}, {
						"c-0": ["\n", "ev", {
							"VAR?": "courage"
						}, 1, "+", {
							"VAR=": "courage",
							"re": true
						}, "/ev", "ev", {
							"VAR?": "hero"
						}, "out", "/ev", "^拨开蕨类跟上。树影在行走间扭曲，仿佛活了过来。", "\n", {
							"->": "plot2_cabin"
						}, {
							"#f": 5
						}],
						"c-1": ["\n", "ev", {
							"VAR?": "courage"
						}, 1, "-", {
							"VAR=": "courage",
							"re": true
						}, "/ev", "^喊声被密林吸收，没有回音。但一阵腐朽木香与铃铛声从身后传来，木杖拨开了草丛。", "\n", {
							"->": "plot2_cabin"
						}, {
							"#f": 5
						}]
					}
				], {
					"#f": 1
				}
			],
			"plot2_cabin": [
				["ev", {
						"VAR?": "hero"
					}, "out", "/ev", "^来到几乎与树融为一体的木屋前。老耿正在打磨手斧，头也不抬地说：“你踩到它的‘根’了。”脚下腐叶微微震颤，地底传来沉闷的嗡鸣，好似整片山林在低声喘息。我低头看向脚底盘绕隆起的暗色脉络，泥土正缓缓顺着鞋缝向上攀爬。", "\n",
					"^老耿曾是地质勘探队向导，在石林发现奇异岩画后同伴接连遇险，他是唯一幸存者。森林意志被疯狂灵体“橡木之心”扭曲了。", "\n", "ev", "str",
					"^相信他，接过水壶", "/str", "/ev", {
						"*": ".^.c-0",
						"flg": 20
					}, "ev", "str", "^半信半疑想离开", "/str", "/ev", {
						"*": ".^.c-1",
						"flg": 20
					}, {
						"c-0": ["\n", "ev", true, "/ev", {
							"VAR=": "has_old_map",
							"re": true
						}, "^“石林在哪？”老耿递来羊皮纸地图：“天黑前到祭坛，取半块石盘，另一半在它枕头底下。”", "\n", {
							"->": "plot3_forward"
						}, {
							"#f": 5
						}],
						"c-1": ["\n", "ev", {
							"VAR?": "courage"
						}, 2, "-", {
							"VAR=": "courage",
							"re": true
						}, "/ev", "^“我得找大部队！”老耿指向窗外，天色暗如黄昏，远处传来低沉的嗡鸣。“往东有猎寮，里面有信号弹。”", "\n", {
							"->": "plot4_trapped"
						}, {
							"#f": 5
						}]
					}
				], {
					"#f": 1
				}
			],
			"plot3_forward": [
				["ev", {
						"VAR?": "hero"
					}, "out", "/ev", "^找到被藤蔓淹没的祭坛。石盘闪烁着磷光，触碰时耳边响起重叠低语：“外来者……请治愈这块疮疤……”", "\n",
					"^刚挖出石盘，三头目光空洞、缠着枯藤的野狼逼近——它们是橡木之心的哨兵。", "\n", "ev", "str", "^高举石盘驱散狼群", "/str", "/ev", {
						"*": ".^.c-0",
						"flg": 20
					}, "ev", "str", "^爬上古树观察", "/str", "/ev", {
						"*": ".^.c-1",
						"flg": 20
					}, {
						"c-0": ["\n", "ev", {
							"VAR?": "courage"
						}, 1, "+", {
							"VAR=": "courage",
							"re": true
						}, "/ev", "^光芒如波浪扩散，野狼哀嚎退缩。但石盘暗了下去，", "ev", {
							"VAR?": "hero"
						}, "out", "/ev", "^感到一阵虚弱。", "\n", {
							"->": "plot3_1_castle"
						}, {
							"#f": 5
						}],
						"c-1": ["\n", "ev", {
							"VAR?": "hero"
						}, "out", "/ev", "^爬上橡树，狼群在树下徘徊。树冠上，远方有片灰白石林，像大地的疤痕。", "\n", {
							"->": "plot3_1_castle"
						}, {
							"#f": 5
						}]
					}
				], {
					"#f": 1
				}
			],
			"plot3_1_castle": [
				["ev", {
						"VAR?": "hero"
					}, "out", "/ev", "^潜入石林。中央是倒塌石碑构成的门形石堆，一个扭曲光线组成的人形悬浮其间——橡木之心。", "\n",
					"^“你们这些玷污泥土的爬虫，我要让钢筋水泥彻底退潮！”声音如砂纸摩擦玻璃。", "\n", "^地面震动加剧。", "ev", {
						"VAR?": "hero"
					}, "out", "/ev", "^必须做出抉择。", "\n", "ev", "str", "^用石盘引导地脉能量", "/str", "/ev", {
						"*": ".^.c-0",
						"flg": 20
					}, "ev", "str", "^设陷阱炸毁支柱", "/str", "/ev", {
						"*": ".^.c-1",
						"flg": 20
					}, {
						"c-0": ["\n", "ev", true, "/ev", {
							"VAR=": "met_spirit",
							"re": true
						}, "ev", {
							"VAR?": "hero"
						}, "out", "/ev", "^高举石盘，念出“地音咒”。石盘与橡木之心共振，", "ev", {
							"VAR?": "hero"
						}, "out", "/ev", "^看到幻觉：老耿封印此地，而橡木之心的痛苦源头是一块放射性陨石。", "\n", {
							"->": "plot5_collapse"
						}, {
							"#f": 5
						}],
						"c-1": ["\n", "^石门支柱有裂缝。", "ev", {
							"VAR?": "hero"
						}, "out", "/ev", "^倒上燃料点燃，轰然炸响。石门塌陷，橡木之心咆哮着驱使岩石砸来。", "\n", {
							"->": "plot5_collapse"
						}, {
							"#f": 5
						}]
					}
				], {
					"#f": 1
				}
			],
			"plot4_trapped": [
				["ev", {
						"VAR?": "hero"
					}, "out", "/ev", "^找到猎寮，从铁盒里翻出信号枪和两发弹。但藤蔓如蛇从木板缝隙钻出，缠向脚踝——在这里，火光必被橡木之心感知。", "\n", "ev",
					"str", "^朝天鸣枪求救", "/str", "/ev", {
						"*": ".^.c-0",
						"flg": 20
					}, "ev", "str", "^躲入地下储窖", "/str", "/ev", {
						"*": ".^.c-1",
						"flg": 20
					}, {
						"c-0": ["\n", "ev", {
							"VAR?": "courage"
						}, 2, "+", {
							"VAR=": "courage",
							"re": true
						}, "/ev", "^红色信号弹撕裂黑暗，却被无形力量扭曲吸收。远方传来暴怒的咆哮。", "ev", {
							"VAR?": "hero"
						}, "out", "/ev", "^不再躲藏，朝石林冲去。", "\n", {
							"->": "plot3_1_castle"
						}, {
							"#f": 5
						}],
						"c-1": ["\n", "^扯开地板活门跳下去，阴冷干燥。一本泛黄日记记载了老耿封印橡木之心的过程，提到另一半石盘在石林中心。", "\n", "ev", {
							"VAR?": "unlocked_clue"
						}, 1, "+", {
							"VAR=": "unlocked_clue",
							"re": true
						}, "/ev", "^等外面动静稍歇，", "ev", {
							"VAR?": "hero"
						}, "out", "/ev", "^推开窖门潜行。", "\n", {
							"->": "plot3_1_castle"
						}, {
							"#f": 5
						}]
					}
				], {
					"#f": 1
				}
			],
			"plot5_collapse": [
				["^石林震荡加剧。橡木之心将树木生命力吸入体内，形成木石组成的“森林泰坦”。", "\n", "^森林灵裔的声音尖锐：“最后一击……用火与地音的交汇之处！”", "\n",
					"ev", {
						"VAR?": "hero"
					}, "out", "/ev", "^看着半块石盘和最后一颗信号弹，明白了：地脉惧怕剧烈热量。", "\n", "ev", "str", "^引爆地脉，彻底净化",
					"/str", "/ev", {
						"*": ".^.c-0",
						"flg": 20
					}, "ev", "str", "^引导封印，重建平衡", "/str", "/ev", {
						"*": ".^.c-1",
						"flg": 20
					}, {
						"c-0": ["\n", "^将火药与石粉混合塞进裂缝。白光与轰鸣后，石林坍塌。森林恢复生机，但老耿的木屋方向再无动静。", "\n", {
							"->": "close2_purification"
						}, {
							"#f": 5
						}],
						"c-1": ["\n", "^放弃净化，将石盘嵌入裂缝。柔光束缚狂暴能量，灰白石林沦为被封印的禁区。", "\n", {
							"->": "close3_balance"
						}, {
							"#f": 5
						}]
					}
				], {
					"#f": 1
				}
			],
			"close1_eternal_fade": ["ev", {
				"VAR?": "hero"
			}, "out", "/ev", "^被藤蔓缠绕，意识被森林意志吸收，成为林中游荡的“回音”。偶尔在起雾清晨用风声模仿电台歌声，等待下一个误入者。", "\n", {
				"->": "finish"
			}, {
				"#f": 1
			}],
			"close2_purification": ["ev", {
				"VAR?": "hero"
			}, "out", "/ev", "^跪在废墟中，卫星信号恢复。救援队赶到，石林沦为乱石堆。", "ev", {
				"VAR?": "hero"
			}, "out", "/ev", "^拒绝采访，用奖金在森林边缘建了生态观测站，替老耿守望这片土地。", "\n", {
				"->": "finish"
			}, {
				"#f": 1
			}],
			"close3_balance": ["^封印完成。", "ev", {
				"VAR?": "hero"
			}, "out", "/ev", "^找到老耿，两人成为森林的秘密守护者。每年秋天背着行囊巡逻，检查封印——这是属于探险家的崭新冒险。", "\n", {
				"->": "finish"
			}, {
				"#f": 1
			}],
			"finish": [
				["^<br><br>", "\n", "^<font size='2'>森林静默，回声永恒。你的故事在林间留下了什么样的年轮？</font>", "\n", "ev", "str",
					"^<br>踏入另一段林间回声？", "/str", "/ev", {
						"*": ".^.c-0",
						"flg": 4
					}, {
						"c-0": ["\n", "#", "^RESTART", "/#", "end", {
							"#f": 5
						}]
					}
				], {
					"#f": 1
				}
			],
			"global decl": ["ev", "str", "^我", "/str", {
				"VAR=": "hero"
			}, 5, {
				"VAR=": "courage"
			}, false, {
				"VAR=": "has_old_map"
			}, false, {
				"VAR=": "met_spirit"
			}, 0, {
				"VAR=": "unlocked_clue"
			}, "/ev", "end", null],
			"#f": 1
		}
	],
	"listDefs": {}
};